Revit 2027 API
ParameterTypeId.DimStyleDimLineSnapDist Property
 "Dimension Line Snap Distance"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId DimStyleDimLineSnapDist { get; }
Public Shared ReadOnly Property DimStyleDimLineSnapDist As ForgeTypeId
	Get
public:
static property ForgeTypeId^ DimStyleDimLineSnapDist {
	ForgeTypeId^ get ();
}
static member DimStyleDimLineSnapDist : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace